[
	{"header":"Ускоряем разработку новых фич: как я написал плагин кодогенерации для Protobuf","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3e9/3aa/51b/3e93aa51bfadefd2a600e3f500a91a95.png","title":"Всем привет! Меня зовут Ефим Воробьёв, я учусь на программиста в университете, создаю свои проекты и работаю в стартапе. Я с девятого класса разрабатывал веб-приложения на PHP и Python, зарабатывая на фрилансе. Со временем я понял, что хочу развиваться дальше, и поступил на курс «Go-разработчик» в Практикуме. "},
	{"header":"Profile-guided optimization в Go 1.21","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/0c7/dee/536/0c7dee5360beb38f2b7d1118f31bf6f9.jpg","title":"В Go 1.20 была выпущена предварительная версия profile-guided optimization (PGO), которую пользователи могли протестировать. После устранения ограничений в предварительной версии и дополнительных доработок благодаря отзывам и вкладу сообщества, PGO в Go 1.21 готова к использованию! "},
	{"header":"Масштабирование приёмочных тестов","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/9d9/e4c/641/9d9e4c641ec4d1137422b8c962e7db4e.png","title":"Эта глава является продолжением главы \"Введение в приёмочные тесты\". Готовый код этой главы можно найти на GitHub."},
	{"header":"Работа без имитаторов","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/db9/cd5/c2f/db9cd5c2f951e9643372cd8acc0f26fc.png","title":"В этой главе мы погрузимся в мир тестовых двойников и рассмотрим, как они влияют на процесс тестирования и разработки. Мы раскроем ограничения традиционных mocks (имитаторы), stubs (заглушки) и spies (шпионы) и представим более эффективный и адаптируемый подход с использованием подделок (fakes) и контрактов (contracts)."},
	{"header":"Введение в приёмочные тесты","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/0ef/b6b/dfc/0efb6bdfc4d31f30857fb5341bc1e735.png","title":"В компании $WORK мы столкнулись с необходимостью \"плавного завершения работы\" наших сервисов. Грациозное завершение работы позволяет убедиться в том, что система правильно финиширует перед завершением. В качестве аналогии можно привести ситуацию, когда человек пытается правильно завершить телефонный разговор перед тем, как перейти к следующей встрече, а не просто бросает трубку на середине фразы."},
	{"header":"Готовый набор golang линтеров (джунам и мидлам)","src":"//habrastorage.org/r/w48/getpro/habr/avatars/ec4/f23/c89/ec4f23c89a27b5520e41fcd62a5672ea.png","title":"При рефакторинге легаси проекта перед нами встала задача внедрить в компании готовый линтер-тулз, дабы минимизировать объёмы генерируемого говнокода."},
	{"header":"Golang. Паттерн Adapter","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ce0/32f/937/ce032f937c6618563426ba3bb4a64554.png","title":"Постараемся рассмотреть шаблоны проектирования на примере языка Go"},
	{"header":"Golang: как найти мёртвый код в проекте, а заодно оценить покрытие тестами живого кода","src":"//habrastorage.org/r/w48/getpro/habr/avatars/ce3/7df/795/ce37df79510767d2062653ae435d31be.jpg","title":"В Go 1.20 сделали возможность сбилдить приложение с флагом cover"},
	{"header":"Пакет context в Go: взгляд профессионала","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/7ae/69c/8d2/7ae69c8d24096a7034ee0104a29265dc.png","title":"А вы часто читаете реализацию стандартной библиотеки своего любимого языка?.."},
	{"header":"Создание простого HTTP-сервера для мониторинга контейнеров Docker на Golang","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/15a/608/e51/15a608e517ea58feed6e6c9153b66c7a.jpg","title":"В этой статье мы рассмотрим пример простого HTTP-сервера, написанного на языке программирования Golang, который предоставляет информацию о контейнерах Docker."},
	{"header":"Простейший пример kafka + golang","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/f63/d83/001/f63d830010a45df9b46c31674bed200f.jpg","title":"В данной статье представлен простой способ реализации микросервисной архитектуры с использованием Kafka, Golang и Docker."},
	{"header":"Rust против Go: практическое сравнение","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/67e/9d5/14c/67e9d514cd32b39d9a8db203fc6fae27.jpg","title":"Rust против Go — тема, которая постоянно возникает, и о ней уже много написано. Частично это связано с тем, что разработчики ищут информацию, которая поможет им решить, какой язык использовать для своего следующего (веб) проекта."},
	{"header":"Некоторые советы, которые я почерпнул из книги «100 ошибок в Go»","src":"https://habrastorage.org/webt/oh/vw/go/ohvwgoufeclfebmnxxsmbwuyvgo.jpeg","title":""},
	{"header":"Golang глазами PHP-программиста","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/dd4/de6/f1e/dd4de6f1eee149d6397bac38542b17d4.png","title":"Как-то появилась причина попробовать пописать на Go. На тот момент я знал, что это язык от Google, язык молодой, язык компилируемый, вроде как активноразвивающийся и с зарплатами выше средних. Неплохой набор."},
	{"header":"Визуализация исходного кода на языке golang","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/1ed/d56/b1c/1edd56b1ca375b0aac27dcc9c16385ed.jpg","title":"Исходный код программы надо визуализировать — отобразить в виде схем для лучшего понимания, изучения, осмысления, создания документации и др."},
	{"header":"Реверс бинарных файлов Golang с использование GHIDRA. Часть 2","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/bf1/144/7de/bf11447ded7d8339a9cbdfb6968b823c.png","title":"Это вторая часть нашей серии о реверс-инжиниринге двоичных файлов Go с помощью Ghidra. В предыдущей статье мы обсуждали, как восстановить имена функций в удаленных файлах Go и как помочь Ghidra распознавать и определять строки в этих двоичных файлах. Мы сосредоточились на двоичных файлах ELF, лишь кратко упомянув различия между PE-файлами."},
	{"header":"Битва за производительность: SparseMap vs GenerationsMap","src":"https://habrastorage.org/webt/c6/ly/hi/c6lyhi1mticxgdncn5xg4hdf9ok.png","title":"Есть такая занимательная структура данных, описанная в статье Russ Cox — sparse map."},
	{"header":"В Go меняется фундаментальная вещь — цикл","src":"//habrastorage.org/r/w48/getpro/habr/avatars/ce3/7df/795/ce37df79510767d2062653ae435d31be.jpg","title":"Если раньше в циклах были проблемы с замыканиями, так как переменная цикла имела скоуп всего цикла, а не одной его итерации, то в 1.22 это поведение поменяют."},
	{"header":"Конкурентность — это не параллелизм","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/42e/925/81e/42e92581edc1394340b01322bd8aa360.png","title":"Это полное изложение замечательного доклада Роба Пайка \"Concurrency is Not Parallelism\". Иллюстрации и диаграммы воссозданы, исходный код взят дословно со слайдов, за исключением комментариев, которые в некоторых местах были расширены."},
	{"header":"Книги для Golang-разработчиков: подборка для программистов с опытом","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/713/fae/f7b/713faef7b897a44cd8c2feab96232b89.png","title":"Привет, Хабр! Относительно недавно мы уже публиковали подборку книг по Go для начинающих разработчиков. Теперь пришёл черёд изданий для специалистов с опытом. В этой статье рассказываем о книгах для программистов, у которых уже есть опыт работы с Golang и кто готов двигаться дальше. Книги актуальные, написаны как на русском, так и на английском языке. Как всегда, просьба: если у вас есть собственные предпочтения, расскажите о них в комментариях."},
]
[
	{"header":"Планирование в Go: Часть III — Конкурентность","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/0e2/52c/e50/0e252ce508ac31a8794f550cbe9700e0.png","title":"Это третья статья из серии, состоящей из трёх частей, в которой мы рассмотрим механику и семантику планировщика в Go. Эта статья посвящена конкурентности."},
	{"header":"Книга «Golang для профи: Создаем профессиональные утилиты, параллельные серверы и сервисы, 3-е изд.»","src":"https://habrastorage.org/webt/hj/fm/um/hjfmumxag0mxctcubltj0prrwcw.jpeg","title":""},
	{"header":"Приглашаем на Ozon Tech Community Go Meetup","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/747/545/10d/74754510d8e62c451d7886e0d97dddc1.jpg","title":"Всем привет! Я – Влад, руководитель группы поисковой оптимизации в Ozon. "},
	{"header":"Дебажим Golang с помощью Delve","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/74a/93b/65b/74a93b65b321234668ea4db5558cc0d1.png","title":"В этой статье мы рассмотрим, как дебажить программы, написанные на Golang, с помощью Delve. Delve — это сторонний отладчик для Go, скачать на github по ссылке https://github.com/go-delve/delve. Это хорошая альтернатива отладчику GDB golang (https://golang.org/doc/gdb), так как Delve куда больше возможностей для работы.  "},
	{"header":"Разворачиваем приложение в кластере Kubernetes под управлением Deckhouse c помощью werf","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/bd1/f4f/c45/bd1f4fc4517a504908e833e8f515071d.png","title":"В статье мы рассмотрим, как подступиться к миру Kubernetes в первый раз — развернуть кластер под управлением платформы Deckhouse, разработать и подготовить приложение, развернуть его с помощью утилиты werf, предназначенной для построения рабочего процесса по принципам CI/CD, а также настроить сертификаты для доступа по HTTPS."},
	{"header":"Стоит ли идти на курсы IT преподавателем?","src":"//habrastorage.org/r/w48/getpro/habr/avatars/250/b17/1a0/250b171a0f61427e98210b228950beb9.jpg","title":"В рамках данного текста я попробую ответить вам и себе на вопрос из заголовка - \"Стоит ли идти читать курсы по программированию?\" Будет честно, если также я обозначу, что далее вы не найдете ответа на вопрос: стоит ли идти на IT-курсы учиться."},
	{"header":"Практика Go — Обработка ошибок (2 часть)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/28e/aa8/5d7/28eaa85d7594d310775a8b641afb5c0e.png","title":"Сборник реальных советов по написанию сопровождаемых программ на языке Go. Автор - Dave Cheney, опытный разработчик на Go и один из его ведущих пропагандистов."},
	{"header":"Практика Go — Обработка ошибок (1 часть)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/f13/192/036/f13192036fb6b43e30139dacd8227397.png","title":"Я долго думал над тем, как лучше всего обрабатывать ошибки в программах на языке Go. Мне очень хотелось, чтобы существовал единый способ обработки ошибок, которому можно было бы научить всех программистов на Go, как учат математике или алфавиту."},
	{"header":"Практика Go — Concurrency","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/979/ee0/343/979ee0343218d536e63db4b35fb7be65.png","title":"Сборник реальных советов по написанию сопровождаемых программ на языке Go. Автор - Dave Cheney, опытный разработчик на Go и один из его ведущих пропагандистов."},
	{"header":"Чему вы научитесь на бесплатном курсе VK Education по Go?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/2ff/647/7bd/2ff6477bd57fbec200f817cc37750ca9.jpg","title":"Привет, Хабр! Меня зовут Антон Сулаев, я руководитель команды бэкенд-разработки Почты Mail.ru в VK и по совместительству ведущий преподаватель онлайн-курса «Разработка веб-сервисов на Golang». Недавно мы рассказали об открытии набора на новые бесплатные курсы VK Education по нескольким востребованным направлениям — программирование на Python и Go, а также техподдержка."},
	{"header":"Практика Go — Основы","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/57e/9d4/211/57e9d4211eea6f785a06fbd176d5d2dd.png","title":"Сборник реальных советов по написанию сопровождаемых программ на языке Go. Автор - Dave Cheney, опытный разработчик на Go и один из его ведущих пропагандистов."},
	{"header":"Шпаргалка для собеса по GoLang","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3dc/1ea/f1f/3dc1eaf1f3ee31d1f490f666e79b0f6d.png","title":"\"Правильно заданный вопрос - половина ответа\". Осваиваю профессию Prompt Engineering. Это ответы на вопросы. Мопед не мой. Спасибо, Codeium. Не обрабатывал наводящие подвопросы, а надо бы. Но может быть кому-то пригодится и в таком виде."},
	{"header":"Как школьник с эпилеписей разбирался, или опыт участия в True Tech Hack","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/4ff/875/ee3/4ff875ee38002be11d0ccf2e404ca93a.png","title":"Все слышали про \"эпилепсию\", иногда натыкались на видео с пометкой \"epilepsy warning\". И вроде бы понятно, что это что-то связанное с резкими мерцаниями и переменами цветов, но так ли все просто на самом деле? На True Tech Hack одной из задач учатников стала \"Адаптация фильмов для людей с особыми потребностями\", а одной из таких потребностей стала возможность фильтровать или изменять сцены, которые могли бы вызвать эпилептические припадки. Именно о решении мною этой задачи я и хочу рассказать далее."},
	{"header":"Мультиплатформенность приложений в 2023","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/18b/546/d6e/18b546d6e7e1df26eaadc987c7e7e04a.jpg","title":"Где в 2023 году искать настоящую нативную кроссплатформенность?"},
	{"header":"Лучший regexp для Go. Benchmark c другими ЯП. Сравнение библиотек","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c03/a71/e51/c03a71e51fe3408f4d679643d30c75a7.png","title":"\"Не используйте регулярки - иначе вместо 1 проблемы, у вас их станет 2!\" - как то так говорят знатоки... А что остается делать непослушным, желающим эффективный поиск по большому количеству шаблонов?"},
	{"header":"Бесконечное радио создаваемое нейронными сетями. Open-source проект","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/d2d/bbb/9ce/d2dbbb9cebb932c2fdbff027218000ec.jpg","title":"Привет всем увлеченным нейронными сетями или тем, кто хочет вникнуть в технологии. Сегодня я хотел бы познакомить вас со своим захватывающим проектом с открытым исходным кодом «Бесконечное нейронное радио». Бесконечное, потому что lofi музыка и подкасты могут генерироваться нейронными сетями бесконечно. В этой статье я бы хотел углубиться в то, как все работает изнутри. "},
	{"header":"Вышел язык программирования Go 1.21: что нового и хорошего появилось? Оцениваем изменения","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/0bd/216/e8f/0bd216e8fb8f45167c09c34144d7287e.png","title":"Мы в МТС очень много всего разрабатываем на Golang, поскольку считаем этот язык программирования весьма достойным для проектов разного масштаба. На нём относительно просто писать, т. е. увеличивается скорость разработки, производительность — высокая, плюс есть защита от ошибок. И вот на днях был представлен Go 1.21. Что улучшили, изменили и добавили? "},
	{"header":"Почему язык Go популярен","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/756/413/567/756413567b90102258e850439a7dbe5e.png","title":"Go, также известный как Golang, — это язык программирования с открытым исходным кодом. Представленный публике в 2009 году, Go был разработан для упрощения задач программирования и повышения эффективности. Он родился из потребности в языке, который был бы прост для понимания, эффективен для выполнения и прежде всего способен справиться с масштабами, в которых работает Google. Его отличают простота, эффективность, многопоточное программирование, кроссплатформенность и высокая скорость компиляции."},
	{"header":"Учимся применять Semaphore и Worker Pool на Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/57d/310/589/57d310589638340f535cf9193b80f5af.png","title":"Привет, Хабр! Я Артём Чаадаев из команды ассортимента размещения в Туту и занимаюсь разработкой на языке Go. Здесь мы посмотрим как решить распространенную практическую задачу применяя паттерны Semaphore и Worker Pool."},
	{"header":"Go's Garbage Collection: как работает и почему это важно знать","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/46b/33f/91d/46b33f91d90b0cd961adfe8df3152b24.png","title":"В статье посмотрим на Go Garbage Collector — механизм автоматического освобождения невостребованной памяти приложения в Go. Разберём его устройство и принципы работы."},
]
[
	{"header":"Expr: простой и мощный ЯП на Go","src":"//habrastorage.org/r/w48/getpro/habr/avatars/3d9/8af/f72/3d98aff721ab45d8fc49855d93296227.png","title":"Привет, Хабр!"},
	{"header":"Можем ли мы сохранить животных с помощью Golang?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/0ea/0b6/64c/0ea0b664ca396813b2a8cac07307f129.jpg","title":"Статья, главным образом, состоит из двух частей: описания проблемы и описания ее решения. Там странный юмор. Еще про загрузку файлов что-то, и немного кода на Golang."},
	{"header":"Из кладовщика в разработчики","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/972/62c/52f/97262c52f2b0501c7bdb7e43cbef7a70.jpeg","title":"В этой статье я расскажу о своем пути от должности рабочего на складе до профессии backend-разработчика в международной компании на Кипре. Также поделюсь практическими советами о том, как можно совершить подобный карьерный переход."},
	{"header":"Хакните HL и заработайте 125.000 рублей","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/aae/d03/067/aaed0306795bd4237d20fc5707f54652.png","title":"При разработке безопасных и/или анонимных приложений всегда наступает такой момент, когда становится необходимым выйти из своих сугубо теоретических размышлений, выйти из скованного дебагом одиночества, выйти из затворничества программных реализаций в открытое общество, безжалостно указывающее на все неправильные, нелогичные, ошибочные, уязвимые части «итогового продукта». Это есть необходимый этап в разрушении ожиданий, идеалов, а также сомнений, чтобы вследствие своей закалки, продукт стал бы поистине безопасным."},
	{"header":"Используем Hashicorp Vault для хранения секретов","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ed4/2b9/5d5/ed42b95d5a869937a6c0f8730a475288.png","title":"В этой статье хотелось бы поделиться практикой использования хранилища секретов от компании Hashicorp, и называется оно Vault."},
	{"header":"От C до Go. Как Golang объединил лучшие черты своих предшественников","src":"https://habrastorage.org/webt/v8/vp/8y/v8vp8yugit9kyhnqjefv8gp8zci.png","title":""},
	{"header":"Отранжированные и смешные: создаем систему выстраивания пользовательской ленты","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/d2f/79e/0a6/d2f79e0a665892d51f6ee7a6c99c4a2a.png","title":"Всех приветствую! Меня зовут Кирилл, я Go-разработчик в компании Ozon. Сейчас моим полем деятельности является разработка микросервисов в департаменте Fresh, однако я также успел принять участие в некоторых других интересных проектах."},
	{"header":"В Go 1.21 существенно расширяется стандартная библиотека","src":"//habrastorage.org/r/w48/getpro/habr/avatars/ce3/7df/795/ce37df79510767d2062653ae435d31be.jpg","title":"Год назад в блоге Каруны мы писали про дженерики в Go, и там упоминалось, что гошное сообщество разделилось на две части. Не всем это нововведение было нужно, особенно в простом продуктовом коде. И надо сказать, это до сих пор так, дженерики по-прежнему используют далеко не все проекты."},
	{"header":"Как протестировать код на Go с базой данных?","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/49d/0e1/ee7/49d0e1ee718faebb61f68c80b9e102ec.png","title":"Как протестировать код на Go с базой данных? В этой статье опишу пример такого тестирования в связке с Postgres, очисткой на основе копирования базы данных и рассмотрю некоторые альтернативы."},
	{"header":"Golang — архитектурный линтер","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/baa/6c5/fc4/baa6c5fc4c666418281edc76201c4d02.png","title":"Для того чтобы повысить качество приложения, написанного на языке go, можно использовать разные линтеры. Один из таких линтеров — архитектурный."},
	{"header":"Сравниваем скорость и оверхеды библиотек Deep Copy для Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/02b/d3f/444/02bd3f4448240d96846d81cb81505c5e.png","title":"Егор Гартман, бэкендер Авито, рассказал, как протестировал несколько библиотек Deep Copy, а потом сделал свою — быстрее и эффективнее. "},
	{"header":"Добавляем Starlark в приложение на Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ebc/8f8/fd5/ebc8f8fd54cf8820e44af450899f7c11.png","title":"Starlark (ранее известный как Skylark) - питоноподобный язык, изначально разработанный для системы сборки Bazel, со временем выбравшийся за её пределы через интерпретаторы для Go и Rust."},
	{"header":"Как начинать проект на Go в 2023 году","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/dd1/f8d/493/dd1f8d49364fe830ffb6d33d8de51b6b.png","title":"Когда-то я написал статью о том, как начинать проект на Go в 2018 году. С тех пор многое изменилось, и я захотел написать обновлённую версию статьи. В ней я расскажу всё, что нужно новичку, чтобы приступить к работе с Go."},
	{"header":"Как построить систему, способную выдерживать нагрузку в 5 млн rps","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/467/b39/24b/467b3924b1595858266b2ebe6f877128.jpg","title":"Всем привет! "},
	{"header":"Go: особенности написания конкурентных программ","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/ac4/705/558/ac470555852aa98ee2d9310d8448d9f3.jpg","title":"Всем нам предстоит поддерживать уже существующий код, а также проводить ревью кода коллег."},
	{"header":"Криптография на Rust и немного FFI","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e03/47a/012/e0347a012596f996733e68708aee2803.png","title":"Расскажу как создать Bitcoin кошелек используя только криптографические функции и о своем опыте разработки FFI (меж-языковой) библиотеки для Go."},
	{"header":"Микросервисы в банке: на чем их лучше писать? Java/Kotlin, а может Go?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/dab/223/fe9/dab223fe90f220923a460a43ec496555.jpeg","title":"В июле в офисе РСХБ-Интех (технологической дочки Россельхозбанка) состоялся бесплатный митап для Java-разработчиков — RSHB Backend Dev Meetup. Обсудили Kotlin, Go, маппинг и разные аспекты бэкэнд-разработки. В числе докладчиков выступал Иван Кочергин, руководитель центра собственной разработки РСХБ-Интех. Иван более 10 лет занимается разработкой на Java, последние три года — на Kotlin. В своем докладе он сравнил, на чем лучше писать микросервисы в банке: Java, Kotlin или Go. Делимся расшифровкой доклада. Запись всего митапа можно посмотреть на Rutube."},
	{"header":"Учимся разрабатывать REST API на Go на примере сокращателя ссылок","src":"https://habrastorage.org/webt/nu/zw/hy/nuzwhyv5b2ygn8f6gdmyddoog2s.jpeg","title":""},
	{"header":"Простые правила, которые помогают мне писать на Go без побочных эффектов","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/ada/a77/b00/adaa77b00300cbaa4c488f4a6a6331db.jpg","title":"Роб Пайк сказал, что простое лучше, чем сложное. Я бы добавил: простое лучше, чем прикольное. Ведь Go спроектирован, чтобы писать программы в простом стиле. "},
	{"header":"database/sql биндинги для YDB в Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e4d/db4/b58/e4ddb4b5890a52e7588f76885799826e.png","title":"YQL — это SQL‑диалект, специфичный для базы данных YDB. YQL требует заранее объявлять имена и типы параметров запроса. Это обеспечивает высокую производительность и корректное поведение. В синтаксисе YQL параметры необходимо перечислять явно с помощью инструкции DECLARE. И этот нюанс YDB может быть неожиданным для пользователей традиционных баз данных. В статье раскрывается вспомогательный механизм, позволяющий писать привычные простые SQL‑запросы при работе с YDB."},
]
[
	{"header":"5 книг по Golang для начинающих разработчиков: на что стоит обратить внимание","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/540/53f/abd/54053fabdb70978fc07f9071b1205643.png","title":"Привет, Хабр! Сегодня поговорим о Golang, вернее, о хороших книгах, которые написаны для начинающих разработчиков. Возможно, какие-то из этих книг пропустили в своё время и более опытные программисты — если так, стоит обратить на них внимание. Если же вы можете порекомендовать книги по Go, которые понравились именно вам, пишите в комментариях, обсудим и их. Ну а пока — поехали."},
	{"header":"Основы Go: функции","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/cd5/b34/826/cd5b34826b406a802e9b2ef5fbd0edc5.png","title":"Автор статьи: Рустем ГалиевСегодня мы рассмотрим, как писать и вызывать функции в Go. Мы также изучим, как правильно обрабатывать ошибки в функциях, и узнаем об использовании функций в качестве типов данных. Попутно мы будем использовать структуры управления if, for и switch в Go."},
	{"header":"Обработка ошибок в go в 2023 г","src":"https://assets.habr.com/habr-web/img/avatars/019.png","title":"В go нет исключений. Разработчики, начинающие знакомиться с go, часто не знают как лучше всего обработать ошибку, как её отобразить в логах и что с ней делать дальше."},
	{"header":"Оптимизация памяти и управление сборщиком мусора в Go: GOGC и GOMEMLIMIT","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/f14/fd0/6c4/f14fd06c4396f054093792b5cf2a2bba.png","title":"Всем привет, меня зовут Нина Пакшина, я работаю Golang разработчиком в Лента Онлайн в команде операций."},
	{"header":"Анонимная сеть в 200 строк кода на Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/658/95c/f58/65895cf58cd976a49d779c4a9bdf4580.png","title":"Реализации анонимных сетей всегда стремятся быть как можно проще, доступнее для понимания, как на теоретическом, так и на программном уровнях. Такие условия становятся необходимыми вследствие одного из основных принципов построения безопасных программ — чем проще объяснить, тем легче доказать. Но к сожалению теория часто может расходиться с практикой, и то, что легко объяснить в теории, может быть проблематично объяснять на коде. "},
	{"header":"Пишем свою мини-СУБД на Golang (Часть 1)","src":"//habrastorage.org/r/w48/getpro/habr/avatars/794/302/2c2/7943022c200fe9a9f4376a377efc1d77.jpg","title":"В этой статье, мы начнем подготовку к созданию своей небольшой базы данных, используя Go и его стандартную библиотеку."},
	{"header":"Атомики в Go: особенности внутренней реализации","src":"//habrastorage.org/r/w48/getpro/habr/avatars/9d8/0a0/6a3/9d80a06a34f538557383c8ba4bab9d8b.jpg","title":"Атомики в Go - это один из методов синхронизации горутин. Они находятся в пакете стандартной библиотеки sync/atomic. Некоторые статьи сравнивают atomics с mutex, так как это примитивы синхронизации низкого уровня. Они предоставляют бенчмарки и  сравнения по скорости, например Go: How to Reduce Lock Contention with the Atomic Package. "},
	{"header":"Эффективная работа с битами при помощи Go","src":"https://habrastorage.org/webt/ts/5m/b2/ts5mb2fbmbifduwoqudvgwnchho.png","title":""},
	{"header":"Инструменты сисадмина: Perl и Golang","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/95b/a6c/8ec/95ba6c8ecd1db41f3af6ce9e0bd54834.jpg","title":"В статье отражен опыт применения языков Perl и Golang в повседневной работе бородатого сисадмина в качестве скриптового языка и показаны примеры использования."},
	{"header":"Типы, больше типов","src":"https://assets.habr.com/habr-web/img/avatars/117.png","title":"При описании модели данных, часто приходится создавать новые типы, в первую очередь, используя такие ключевые слова как class/struct/record. Я же предлагаю взглянуть на случаи, когда моделируемая сущность, описывается существующими, часто простыми типами, такими как целое число или строка. В статье хочу поделиться мыслями, которые привели меня к использованию специальных типов там, где часто используются встроенные: int, string и тому подобные. И как удобно (относительно) это делать. Примеры приведу на языках Scala, Go и C++."},
	{"header":"Типы, методы и интерфейсы","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/bdc/8ef/d72/bdc8efd728cbcb9739664f551d733347.png","title":"Большая часть того, что называют написанием идиоматического кода на Go — это изучение использования преимуществ определяемых пользователем типов Go. Интерфейсы —  единственный тип в Go с динамической диспетчеризацией. Поскольку они реализованы неявно,то позволяют разработчикам создавать несвязанный, удобный для сопровождения код. Встраивание типов в Go позволяет совместно использовать код без сложностей наследования. Наконец, способность Go прикреплять методы к любому определяемому пользователем типу, позволяет использовать некоторые очень умные функции, включая типы функций с методами, которые могут реализовывать интерфейсы."},
	{"header":"3 доклада для тех, кто недавно с Go: материалы митапа в Петербурге","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/967/1f4/242/9671f4242d6f76eaff4c69ed6930bf1b.jpg","title":"«Что самое крутое вы сделали за год, что пишете на Go», — вопрос из зала после первого доклада."},
	{"header":"Go scheduler. Простыми словами","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/cef/1c2/e8c/cef1c2e8ce0747066961fbceab8bbdb0.jpg","title":"В данной статье расскажу о планировщике Go. Основу материала взял из книги Уильяма Кеннеди Ultimate Go. Вначале поговорим о планировщике OS, после перейдем к планировщику Go и сравним их."},
	{"header":"Авакари — сервис для публикации и подписки на релевантные сообщения","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/70d/bd9/f90/70dbd9f9047885b455584110c89dbd8c.png","title":"В предыдущей статье \"Дерево Киви для поиска шаблона по тексту\" я рассказывал, как можно эффективно находить по входящему сообщению все удовлетворяющие \"поисковые запросы\", избегая их перебора \"в лоб\" и прямого сопоставления. Это можно применить реализации полноценной Pub/Sub-системы, дополняющей уже существующие, такие как Nats, Apache Kafka или AWS SNS новой возможностью поддерживать действительно масштабируемое число wildcard-подписок. В этой статье я расскажу о такой системе."},
	{"header":"Стеганографические эксперименты с видеофайлами и Youtube. Продолжение","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/33b/ed0/9e1/33bed09e1dedcdb2c7d698413e92d556.jpg","title":"С момента публикации первой части статьи появились интересные инструменты, демонстрирующие побочные возможности Youtube для хранения цифровой информации. Например, утилита Infinite-Storage-Glitch. Автор утилиты DvorakDwarf, пользуясь рациональным размещением цифровой  информации в черно-белом формате CV_8UC3, успешно использовал Youtube если не в качестве полноценного дропбокса, то в качестве прототипа альтернативного файлового хранилища, что вызвало массу различных инспираций и породило бурную реакцию пользователей, в том числе этического характера."},
	{"header":"table-driven testing в Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/01f/07d/992/01f07d9924efaf4afa19647ab424d681.png","title":"Привет Хабр! Продолжая тему тестирования на Go, сегодня поговорим про table-driven тестирование.У нас есть основная проблема: дублированный тестовый код."},
	{"header":"Bot-Games.Fun — игровая платформа для AI","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/f02/979/6f7/f029796f7aa8abc02d26febe50d5293e.png","title":"Почти год назад я рассказывал о платформе HighLoad.Fun, где можно посоревноваться в оптимизации кода, но не упомянул Bot-Games.Fun - платформу, где нужно написать своего AI бота для участия в играх. Основное отличие от других аналогичных платформ - код бота не надо загружать на сервер, его нужно запускать на своём железе, что открывает широчайшие возможности по используемым технологиям и затраченным ресурсам на просчёт следующего хода. А ещё все игры с открытым кодом, можно влиять на правила, улучшать плеер, воспроизводящий игры, можно довольно просто написать свою игру, как это сделать расскажу под катом, а заодно и про архитектуру проекта."},
	{"header":"Пишем gRPC автотесты на Go с Allure отчетом","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/2d0/ea2/2f1/2d0ea22f1be4f46d65069910255a04ba.png","title":"В данной статье разберем, как писать gRPC автотесты  с использованием языка Go, также сделаем Allure отчет "},
	{"header":"Как мы сделали grpc-wiremock: сервис, создающий мок-сервер для ваших контрактов в одну команду","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/583/9c3/838/5839c383826f9d16876b3e6e04a7f96f.png","title":"Всем привет, меня зовут Никита, уже пару лет я зарабатываю на жизнь развитием платформы-как-сервис в СберМаркет. В основном отвечаю за инструменты локальной разработки. Являюсь одним из создателей cli, которая позволяет развернуть сервис со всеми его зависимостями в одну команду sbm-cli service up."},
	{"header":"Погружение в мокирование gRPC сервисов в Go: Тестирование без выполнения RPC вызовов","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/94b/c76/ebe/94bc76ebe0b5b435bbf47e17c65f073f.png","title":"Для чего я это написал"},
]
[
	{"header":"О массивах и слайсах в Go","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/8a6/87f/931/8a687f9310a9a5d807231de766d2cc84.jpg","title":"Массивы в Go являлись для меня одной из сложных тем, так как я не понимал как они работают. В данной статье рассмотрим как же именно работают слайсы и массивы в Go, а также как именно работает append и copy."},
	{"header":"Сколько памяти нужно для запуска 1 миллиона конкурирующих задач?","src":"https://habrastorage.org/webt/px/hj/zm/pxhjzmxldpkgrlxtclpuvgg1tt4.png","title":""},
	{"header":"Основы тестирования Go: простые тесты, testify и визуализация покрытия","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ee5/773/aaf/ee5773aaf5f76e7e06b456fc9dfb2b3c.png","title":"Привет Хабр! Иногда мне приходится расширять функционал наших платформ по запросам разработчиков и в для этого мне отлично подошел Go. Однако нужно не только уметь писать на языке, но и уметь его тестировать. Как вы поняли, сегодня я хотел бы рассказать про основы тестирования в Go.Тестирование — это первостепенная задача в Go. Пакет тестирования предоставляет API для написания тестового кода. Опишу упражнение, в котором мы реализуем и выполним базовые тестовые случаи с помощью стандартного пакета тестирования. Выполним их с помощью набора инструментов Go."},
	{"header":"Осваиваем чистую архитектуру кода на Golang: практическое руководство по сущностям и слоям моделей","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/8a6/e9c/b09/8a6e9cb0971671ef30391b4178d24715.png","title":"В архитектуре кода иногда разделяют слой сущностей и слой моделей. В этой статье я расскажу о них и приведу два примера кода на языке Golang."},
	{"header":"Как обрабатывать ошибки в Golang – рассказываем на собственном примере","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/485/eaf/5f1/485eaf5f15da956aab5b9e6ba2bbf1fe.png","title":"Ошибки это один из самых важных аспектов любого языка программирования. То, как обрабатываются ошибки, влияет на приложения многими способами. То, как определяются ошибки в Golang, немного отличается от таких языков как Java, Python, Javascript. В Go ошибки – это значения."},
	{"header":"[Разбор резюме] Бэкендер на Go: почему «ключевые навыки» никому не нужны и как уместить весь опыт на одной страничке","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/c93/301/bb3/c93301bb3314fea2029209b78a8c38d4.jpg","title":"Привет, Хабр! Мы много разговариваем про найм, и решили запустить новую рубрику — разбор резюме. В ней наши профессиональные HR, которые регулярно просматривают сотни резюме, будут смотреть на присланные CV специалистов и советовать, что в них можно улучшить. Делать мы это будем именно с точки зрения HR-специалистов: они расскажут, что именно их бы оттолкнуло, а что — привлекло. Начнем с резюме бэкендера и дальше пойдем по другим профессиям."},
	{"header":"Как задеплоить своего телеграм-бота (почти) бесплатно — Quickguide в облачный Serverless","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/a27/230/d35/a27230d351af7bb232545f0681ac1367.png","title":"Всем привет! Меня зовут Антон Брехов. Я инженер в Yandex Cloud. Сегодня хочу рассказать о том, как дешевле всего задеплоить своего телеграм-бота. Возможно, этот опыт пригодится и для других решений."},
	{"header":"Для чего нужен тип http.ResponseController?","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c87/cff/8f8/c87cff8f82c3f5c3e6fa7f095287d52f.png","title":"Одно из моих самых любимых нововведений в недавнем релизе Go 1.20 — это тип http.ResponseController, который может похвастаться тремя очень приятными полезностями:"},
	{"header":"Обнаружение утечек памяти в Go через Pyroscope","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/644/0b5/837/6440b5837dd51575169cd25008a82cc7.png","title":"Для обнаружения аномально высокой длительности выполнения отдельных функций (а также избыточного выделения или утечек памяти) используются инструменты профилирования над виртуальной машиной (например, JProfiler или Visual VM для JVM) или интегрированные в выполняемый код, например встроенный механизм при компиляции Go-приложений. Альтернативой может стать использование универсальных механизмов профилирования, которые интегрируются со средой выполнения и отправляют результаты профилирования на сервер, который может анализировать аномальное поведение и визуализировать выделение памяти и время выполнения отдельных функций (и построить flame graph по результатам анализа приложения во время выполнения). В этой статье мы рассмотрим использование Pyroscope совместно с Go для обнаружения утечек памяти."},
	{"header":"Получаем сертификат ЦРУ перебирая архивы","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/a89/9fe/26f/a899fe26f7ff7451d2035015f926aa73.png","title":"Когда-то давно передо мной стояла задача по поиску файлов на ресурсах, которые могли уже не работать или определённые данные с них были удалены. Тогда для этой цели я использовал веб архивы Common Crawl и самопальный инструмент для автоматизации взаимодействия с ним."},
	{"header":"Русские шашки: реализация минимакса с альфа-бета отсечением в Golang","src":"//habrastorage.org/r/w48/getpro/habr/avatars/3d9/8af/f72/3d98aff721ab45d8fc49855d93296227.png","title":"В предыдущих записях блога мы обсудили, как эффективно генерировать ходы и представлять шашечную доску в Golang. Теперь мы углубимся в сердце нашей игры в шашки: ИИ, который принимает решения. ИИ будет использовать алгоритм Minimax с  Alpha-Beta отсечением, популярный метод принятия решений в настольных играх."},
	{"header":"Несколько мыслей по подготовке к алгоритмической части собеседования","src":"https://habrastorage.org/webt/ql/j8/vt/qlj8vtf0_h1y-_rrtu3nkoirau4.png","title":""},
	{"header":"Приходите на Samokat.tech Meetup про Golang-разработку","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/858/7c2/2d6/8587c22d66288f2ea50936b46c45b0cc.jpeg","title":"Когда: 18 мая (четверг), 18:00 – 20:15 МСК/СПБ"},
	{"header":"[По полочкам] Кэширование","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ec1/c98/5ba/ec1c985ba0281426f33af5b6bf3ccd4d.png","title":"Всем привет! Меня зовут Илья Денисов, я занимаюсь backend разработкой уже более пяти лет и сейчас пишу на языке go. Сегодня я предлагаю вам поговорить о кэшировании. Постараюсь рассказать о базовых концепциях, а также затронуть ряд особенностей, неочевидных на первый взгляд."},
	{"header":"Русские шашки: представление доски с помощью двух uint64","src":"//habrastorage.org/r/w48/getpro/habr/avatars/3d9/8af/f72/3d98aff721ab45d8fc49855d93296227.png","title":"При разработке игр, особенно таких настольных игр, как шашки, представление доски является важнейшим компонентом производительности игры. Доска - это, по сути, состояние игры: на ней хранится вся информация о положении фигур, о том, чей сейчас ход, и другие важные данные игры. Эффективность представления доски влияет на скорость и эффективность генерации ходов ИИ, что в свою очередь влияет на игровой процесс."},
	{"header":"Создаём репозиторий в Go через менеджер транзакций","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/f9a/0ca/7a9/f9a0ca7a9035f5f8315647ce5c4c8f01.jpg","title":"Всем привет, я Илья Сергунин, веб-разработчик из продуктовой команды Авито. Мы пишем на Go сервис для трейд-ин мобильных телефонов. На его примере покажу, как устроен наш менеджер транзакций. "},
	{"header":"Go-митап для тех, кто переходит или недавно перешел на Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/22d/a75/7ce/22da757ceb98f97f63d2c94b0b4f8adf.png","title":"Привет, Хабр! "},
	{"header":"Облегчаем жизнь разработчиков на Go: полезные советы и лайфхаки для начинающих","src":"https://habrastorage.org/webt/u4/lf/m1/u4lfm1mqfngqmvnc1u788cja0kg.png","title":""},
	{"header":"Документирование API сервисов с помощью Swagger на примере фреймворков Express.js и Gin","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/4d9/d96/db0/4d9d96db04587f39dd5efff21e36bfc8.png","title":"В современных реалиях разработки программного обеспечения бывает достаточно трудно быстро и качественно написать техническую документацию к проекту, особенно когда данному процессу уделяется недостаточно времени по разным причинам: от временных ограничений, до индивидуальной непереносимости монотонного процесса участниками проектной группы, который, порой, может тормозить рабочие процессы."},
	{"header":"Jaeger для трассировки в микросервисной архитектуре","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b84/ce3/b34/b84ce3b3448fafb2f8ecfc48f1371812.png","title":" Меня зовут Алексей Мясников, я тимлид на проекте YDB в Яндекс Облаке. А ещё — старший ментор на курсе «Go-разработчик» в Яндекс Практикуме и кандидат технических наук. В коммерческой разработке более 15 лет, стек — C++, Java, Go, TypeScript, а пробовал около 20 языков программирования, в том числе в продакшн. "},
]
[
	{"header":"Лучшие Golang-фреймворки в 2023 году","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/380/b02/1c6/380b021c63d55526dfa12c85fe77c244.png","title":"Revel: для быстрой разработки и масштабируемости"},
	{"header":"create-react-app, но для Go?","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/642/7c2/5c6/6427c25c60d8802ef4371ac4106261f5.png","title":"Спустя какое-то время работы с front-end'ом я решил перейти в страшный лес, каким его всегда представляли всякие мемы - back-end. Конечно же я выбрал node.js и начал с express.js. Для меня было необычно, что не было инструмента (или же я плохо искал) для того, чтобы создавать корневую систему директорий самому. Я начал класть все в корень проекта и в этом и не было проблемы до момента, когда надо было расширять проект и начиналась путаница где лежит сервер, а где конфигурации для сервера, БД и т.д."},
	{"header":"Нахождение минимальных путей в разреженных графах, используя матрицу 5xN","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/88d/1e1/f41/88d1e1f4149274221f21a7c3e731dad2.png","title":"Введение"},
	{"header":"Русские шашки: эффективная генерация ходов в Golang","src":"//habrastorage.org/r/w48/getpro/habr/avatars/3d9/8af/f72/3d98aff721ab45d8fc49855d93296227.png","title":"Я рад представить вам свою реализацию ИИ для русских шашек под названием \"damka\" (https://github.com/antonmedv/damka). Проект, размещенный на GitHub и доступен для игры по адресу https://medv.io/шашки/, включает в себя ИИ, который следует правилам игры в русские шашки"},
	{"header":"Создаем скелеты микросервисов быстро и без боли","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e2d/4bb/e87/e2d4bbe8750c7406714349d17757fb67.png","title":"При создании новых сервисов повсеместно используют шаблонизацию, в крайнем случае — в формате ручного копирования кода. Но ручное копирование не исключает ошибок, а еще это муторно и долго. Быстрее и приятнее ответить CLI-утилите на несколько вопросов о будущем проекте и получить на выходе готовый «скелет» сервиса. Остается только начать писать бизнес-логику."},
	{"header":"С чего начать изучение Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/79e/521/dee/79e521dee4a0b68b4164ca56c1e4a27f.png","title":"В этой статье я расскажу про аспекты Golang, на которые стоит обратить внимание в первую очередь, а также приведу ссылки на современные ресурсы для изучения этого языка программирования, которые лучше всего подойдут начинающим разработчикам."},
	{"header":"Разработка игр на Go: шейдеры","src":"https://habrastorage.org/webt/fq/jg/ed/fqjgedeltwlgpfj8h4s6v895r_8.png","title":"Давненько я не писал никаких статей на Хабре."},
	{"header":"Трудности перевода. Как научить микросервисы общаться и не ссориться","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/58a/161/0c8/58a1610c8b1b03b4b4f0ae1b31461181.png","title":"Привет! Меня зовут Саша Сусиков. Я проверяю клавиатуры на прочность около 10 лет из  них последние 2 года с помощью Go. Сейчас я участвую в разработке платформы СберМаркета, где создаю инструменты, которые упрощают жизнь разработчикам. Эта статья для тех, кому предстоит настроить процесс взаимодействия сервисов в компании и вы ищете, как не наломать дров."},
	{"header":"Пишем на Go как в Google. Лучшие практики — часть первая","src":"//habrastorage.org/r/w48/getpro/habr/avatars/96e/81d/bc0/96e81dbc01247c6c855b1806b355efa3.jpg","title":"Этот документ — часть документации по стилю Go в Google. Он не является ни нормативным, ни каноничным, это дополнение к «Руководству по стилю». Подробности смотрите в Обзоре."},
	{"header":"Как работает PGO-оптимизация в Go «на пальцах»","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/2e0/130/958/2e01309587cf992cdaacbf3f06dd7b8f.jpg","title":"В феврале появилась новая версия Golang — 1.20. Разработчики представили в предварительной версии инструмент оптимизации — profile-guided optimization, или коротко PGO. Этот подход позволяет оптимизировать процесс компиляции приложения за счет использования информации, собранной при профилировании сборки в момент выполнения программы в рабочем окружении."},
	{"header":"Страшно ли делать плохо? Прожарка твоего кода онлайн, без купюр","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/36e/138/0ca/36e1380ca0ed5760c4d456b27b9c82fa.jpg","title":"Именно так я решил назвать эту статью, чтобы описать свои эмоции на прожаривании кода спонтанном публичном код-ревью моего open-source Portal от участников Go-чата, в котором я активно участвую. Главным ревьюером был Глеб Яльчик, что делало ситуацию ещё более волнительной для меня. Расскажу, как я на это решился, что мы обсудили, к чему пришли и какой эффект это дало. А внедрять Portal мы будем на примере мини-приложения по мотивам (всеми любимой) мобы Dota. Примечание: это приложение будет что-то делать только в учебных целях, чтобы понять, как Portal сможет нам помочь передавать данные. Логика в нём будет достаточно простой, без ряда проверок и, возможно, с багами. Если станет достаточно интересно, то можем обсудить и его в комментариях!"},
	{"header":"Conc: новая библиотека для управления конкурентностью в Go","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/11f/9f8/25d/11f9f825d58a87ce7c2ccb73a75025dc.jpeg","title":"Одной из главных фишек языка Go является удобная работа с конкурентностью. Однако, в больших проектах всё равно возникают такие проблемы как утечка горутин, некорректная обработка паник в горутинах, плохая читаемость кода. "},
	{"header":"Куда сходить: главные ИТ-события второй половины апреля","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3da/838/d67/3da838d67fdfb9e8c0d3b13715aeeeb8.png","title":"Гид по конференциям и митапам, которые пройдут с 15 по 30 апреля в Москве, Ереване, Екатеринбурге, Алматы и других городах. "},
	{"header":"Приглашаем на Ozon Tech Community Go Meetup (Екатеринбург)","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/f63/052/901/f63052901fd551b838cafae9846871eb.jpg","title":"UPD: Добавили записи докладов и слайды"},
	{"header":"Как построить надёжную шину данных на Apache Kafka","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/eff/d8b/8cb/effd8b8cb86441a9c6dac2eb33a5cb6d.jpg","title":"С помощью Apache Kafka мы в Авито гарантируем соблюдение контрактов публикуемых событий. Рассказываем, как мы переработали архитектуру и сделали работу с Kafka удобнее и надёжнее."},
	{"header":"Тестирование исполняемого кода Go","src":"https://assets.habr.com/habr-web/img/avatars/167.png","title":" «Каждый, уважающий себя программист, осваивая новый язык пишет свой логгер» (с) давно было, источник цитаты канул в Лету, в общем — забылся."},
	{"header":"Go, Allure и HTTP, или Как мило тестировать HTTP-сервисы на Go (часть 2)","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/574/e50/b27/574e50b27f115f97fa50b9b03773f435.jpg","title":"Всем привет! Меня всё так же зовут Сергей, я разработчик в Ozon. "},
	{"header":"Golang-дайджест № 27 (1 – 31 марта 2023)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/439/926/05d/43992605d80718702949c3f043713460.png","title":"Свежая подборка новостей и материалов."},
	{"header":"Материалы python-митапа: Go для питонистов, syslog и контейнерные рантаймы","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/298/a7a/179/298a7a1792aa68fa21da46a2842ff7be.png","title":"Привет, Хабр! Этот пост — отчёт с митапа Moscow Python x YADRO. Мы обсуждали отличия языков Python и Go, подробно разобрали работу с протоколом syslog и почти написали свой Docker. Если вам интересны эти темы — заходите под кат, там вы найдёте видеозаписи докладов, презентации спикеров и небольшой фотоотчёт. "},
	{"header":"Битва за удобный для IDE stack trace в Go (с Bazel и без)","src":"https://habrastorage.org/getpro/habr/upload_files/87c/1c4/4bc/87c1c44bc35339022c6cd3b23f25a3c6.JPG","title":"Разработка программного обеспечения связана не только с написанием кода, но и с его отладкой. И отладка должна быть по возможности комфортной."},
]
[
	{"header":"Алгоритм «Longest common subsequence» на Go. Как прийти к решению?","src":"https://habrastorage.org/webt/wv/sp/hw/wvsphwpl4hcusktrmigxalb1yfu.png","title":"Среди программистов не утихают споры о том, надо ли знать \"алгосики\" для реальной работы, или же это просто некий странный ритуал для прохождения воронки собеседований в компании а-ля FAANG (MANGA). У нас в Каруне в разных командах есть разные мнения на этот счёт. Я, например, как тимлид Go-команды считаю, что некую элементарную базу знать точно бы не помешало, но всё же главное, чтоб человек был хороший."},
	{"header":"Алгоритм Diffie-Hellman: Ключ к безопасному общению","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c5c/0bf/631/c5c0bf631bbd2e1188cf0427e3baacb7.png","title":"Всем привет! "},
	{"header":"Алгебра анонимных сетей","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/5d8/070/ab7/5d8070ab7b1b824ff48414ac65628d16.png","title":"В настоящее время существует огромное количество всеразличного рода анонимных (скрытых) сетей, начиная с теоретически доказуемых (DC-сети, Queue-сети, Entropy-сети) и заканчивая практически используемыми (Tor, I2P, Mixminion). При таком количестве реализаций было бы очень удобно обобщить структуру всех таковых систем и привести их к общим составляющим. В результате подобных действий, мы сможем не только лучше понять то, как строятся современные анонимные сети, но и то, как их можно улучшать. "},
	{"header":"Go в SAMP","src":"//habrastorage.org/r/w48/getpro/habr/avatars/350/dc0/b12/350dc0b126d1c67b16165ce9d6eb801a.jpg","title":"Возможно эта статья покажется Вам странной, ведь вопрос одного из самых популярных мультиплееров для игры GTA: San Andreas давно решён, так или иначе поддержка неофициального фреймворка, если его можно так назвать, для языка GO всё ещё идёт."},
	{"header":"Практические советы по устранению утечек памяти в Go","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/262/dfa/6b6/262dfa6b667e20617a08bfac41325ef5.jpg","title":"В этой статье я расскажу, что делать при обнаружении утечки в Go-приложении: чем могут быть вызваны утечки и с чего начать поиск источника проблемы."},
	{"header":"Клиент Ozon Seller API на Golang","src":"//habrastorage.org/r/w48/getpro/habr/avatars/e9a/d32/d92/e9ad32d9224bd425d074e129226579c0.jpg","title":"Как всем известно, Ozon предоставляет продавцам API для работы с площадкой. В возможности API входит весь функционал площадки, с помощью которого можно работать с карточками товаров, складами, заказами, продвижением своих карточек и даже чатом. "},
	{"header":"Переходим на Go: 16 материалов для самостоятельного изучения языка","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/5d0/eee/f26/5d0eeef2640bfaaa0db0796564273e8e.png","title":"Привет! Меня зовут Владислав Попов, я автор курса «Go-разработчик» Яндекс Практикума. Когда-то я сам был студентом — хотел учиться Go, но такого курса в Практикуме не было, поступил на Python. Прошёл вводную часть — и тут стартовал желанный курс по Go. В тот же вечер оформил возврат и перепоступил. Попал в первый поток, прошёл его, и после сдачи итогового проекта мне предложили стать тестером курса «Продвинутый Go-разработчик»."},
	{"header":"Трассировка сервисов через очередь сообщений. OpenTelemetry, NATS","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/81d/a7a/59b/81da7a59bba625f7c46e8ec4a36a35e7.png","title":"Это небольшой гайд о том, как обеспечить наблюдаемость в вашей событийно-ориентированной облачной системе."},
	{"header":"Go. О покрытии кода интеграционными тестами и флаге -cover","src":"//habrastorage.org/r/w48/getpro/habr/avatars/96e/81d/bc0/96e81dbc01247c6c855b1806b355efa3.jpg","title":"Инструменты покрытия кода помогают понять, какая часть кодовой базы выполняется (или, как еще говорят, покрывается) при выполнении данного набора тестов. Какое-то время Go поддерживал измерение покрытия кода на уровне пакета, введенное в Go 1.2, она включалась флагом команды go test -cover."},
	{"header":"5 паттернов параллельного программирования в GO, которые сделают ваш следующий проект лучше","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/08e/d5a/b58/08ed5ab585a89cd82a3abb679433d6fb.png","title":"Параллельное программирование — одна из самых интересных фич, которые может предложить вам Golang. Идея, лежащая в основе параллелизма, заключается в одновременной работе над несколькими разными процессами, что помогает избежать застревания в задачах, выполнение которых занимает много времени. "},
	{"header":"Как мы сделали для разработчиков универсальную шину событий, не требующую знаний Kafka и прочих брокеров","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/973/23a/51f/97323a51ffe9625bd04a740ec82c8ad0.png","title":"Привет!Меня зовут Петр Коробейников, я техлид команды DBaaS for Redis в #CloudMTS.Некоторое время назад я озадачился созданием общего набора инструментов для наших команд разработки. Цель была проста: разработчик не тратит время на погружение в логику работы конкретного инструмента, берет готовую инструкцию и просто делает свое дело — пишет код. Типовое окружение поможет переходить ребятам из команды в команду и быстро адаптироваться, а новичку — проще приступить к работе. "},
	{"header":"Что не так с твоим покрытием тестов в Go?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/122/06d/223/12206d2238d0b0445cb29274c1734aa7.jpeg","title":"Бюрократия семимильными шагами внедряется в процесс разработки. Людей в пиджаках интересуют лишь цифры, и это же относится к test coverage сервисов. Однако, покрытие зачастую (в том числе, благодаря создателям языка) не отображает полной картины мира. Так ли все плохо на самом деле? "},
	{"header":"Архитектура Hashicorp Vault","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/211/2a8/e99/2112a8e99325e8de922e4606ebdfbf1e.png","title":"В данной статье описал схему маршрутизации и получения данных в hashicorp vault(это зашифированное хранилище секретов с доступом по политикам). Возможно будет полезно тем, кто думает над архитектурой сервера или слоем(‑ми) доступа к данным."},
	{"header":"Эволюция алгоритма фильтрации модификаций товаров в Авито","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/f7c/5b0/f11/f7c5b0f11dc5c00fd93a0cd36019f176.png","title":"Всем привет! Меня зовут Денис Колпаков, я бэкенд-инженер в юните Core Services Авито. Долгое время я был овнером критически значимого для бизнеса сервиса форм, а последний год занимаюсь каталогами и каталогизацией. "},
	{"header":"Bazel, stamping, remote cache","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/e7d/13a/797/e7d13a7976edf0548ae37c3722488c34.jpg","title":"В Bazel есть любопытная фича, позволяющая добавить данные, которые не инвалидируют кэш сборки."},
	{"header":"Сказ о том как pet-project превратился в небольшой пассивный доход (часть 2)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c38/ea4/2da/c38ea42daa1544f30f65154a0f601821.png","title":"Первая Часть"},
	{"header":"Мой путь в профессию: из аналитиков в Go-разработчики","src":"https://habrastorage.org/webt/aj/gi/zu/ajgizuladpsz4b-cuuwxfflbqnw.jpeg","title":""},
	{"header":"Golang-дайджест № 26 (1 – 28 февраля  2023)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/35a/77a/05b/35a77a05b89bde1a91385ded3f18e652.png","title":"Свежая подборка новостей и материалов."},
	{"header":"Выбираем IAM в 2023 или, что есть кроме Keycloak","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/bab/2cc/d3a/bab2ccd3a806a45838bc68c3c206088a.jpg","title":"Гипотетическая ситуация — ваш работодатель поручил вам выбрать Identity and Access Management platform."},
	{"header":"Assembler в Go: техники ускорения и оптимизации","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/63a/20b/93e/63a20b93e92fdfd345e9269dc1316341.jpg","title":"Привет, Хабр!"},
]
[
	{"header":"Шаблон backend сервера на Golang — часть 5 — оптимизация Worker pool","src":"https://assets.habr.com/habr-web/img/avatars/069.png","title":"# Шаблон backend сервера на Golang — часть 5 — оптимизация Worker pool"},
	{"header":"Тайные каналы связи или как централизованные сервисы способны разлагаться изнутри","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/fd9/245/e15/fd9245e1507bf63d6464668622bffc82.png","title":"Современный мир нельзя представить без сервисов связи, таких как социальные сети, мессенджеры, электронная почта, файловые хранилища и т.п. Мы пользуемся данными сервисами постоянно, ровно как и они планомерно пользуются нами. Конфиденциальная информация становится для сервисов связи святым граалем в задачах таргетированной рекламы. А для нас граалем становится их лёгкость использования, высокая производительность и большие размеры хранилищ."},
	{"header":"Как я приложение с Go на Rust переписывал","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3e7/fd1/066/3e7fd106637c33b866a70954973267f3.png","title":"О Rust я слышал ещё несколько лет назад и все его либо хвалили, либо порицали, по различным причинам, но сам как-то не брался за него - мне, неподготовленному к подобному синтаксису и не знакомому с подобными языками хотя бы на базовом уровне, в то время он казался совершенно непонятным. "},
	{"header":"Полиморфизм: подавать холодным","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/4b6/0aa/636/4b60aa6365e9958e38504bb659bd498c.jpg","title":"Полиморфизм является одним из трёх столпов ООП, наравне с наследованием и инкапсуляцией, да и в целом краеугольным камнем современного программирования. Думаю, большинство читателей не представляет своей жизни без полиморфизма, за что я, конечно, это большинство никак не осуждаю, ибо сам к нему принадлежу. Дело, однако, в том, что многие не задумываются об устройстве этого полиморфизма, ведь любой принцип программирования, по сути, представляет из себя математическую матрёшку."},
	{"header":"Путь миграции с go build на Bazel","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/0bb/354/9b3/0bb3549b3aed1e0c23001b044c1cbeb1.jpg","title":"При поиске решений для сборки больших проектов на Go с завидной регулярностью попадались отсылки на статьи про Bazel."},
	{"header":"Брифинг по дженерикам Go 1.18","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/20f/e2f/992/20fe2f99231de863c5277817fc29c0f8.png","title":"Добавление дженериков (generics) в Go (ранее Golang) — самое значительное изменение, которое он претерпел, с момента его релиза. Сообщество Go просило добавить дженерики с самых первых дней языка, и мы, наконец, дождались."},
	{"header":"Fitter —  сшиватель API/Website's, часть личного проекта которую хотел опенсорснуть","src":"https://habrastorage.org/getpro/habr/upload_files/854/156/274/8541562746cce474ce477b39a6fa0fd5.gif","title":"Добрый вечер всем!Возможно выбрал не лучшее время для охвата аудитории, но тем не менее главное чтоб продукт был хороший, а не статья о нем.  Последние несколько недель я пишу приложение в рамках которого надо собирать огромное количество информации из сети(запросы к API/парсинг HTML кода) и под конец 4-ой интеграции я подумал что надо бы это максимально облегчить(не дело это пересобирать приложение под каждый чих интеграции), возможно это не лучшая преамбула, но хотя бы была реальная проблема решение к которой хотелось показать и заопенсорнуть.Итак Fitter = сшиватель достаточно жаргонный перевод, но мне он кажется что лучше всего подходит. Я делал эту штуки исходя из следующих предположений:"},
	{"header":"Сказ о том как pet-project превратился в небольшой пассивный доход (часть 1)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/89a/952/11c/89a95211c344c7995b961db8751e89df.png","title":"Я backend разработчик с опытом около 3-х лет, пишу в основном на Golang. Проработал в нескольких крупных российских компаниях. Сейчас я параллельно со своей работой пытаюсь сделать удобный, дешевый VPN сервис с высокой пропускной способностью. В этой статье я хочу просто рассказать про жизненный цикл своего проекта. Возможно кому-то будет просто интересно почитать, а кто-то может почерпнуть что-то новое для себя.  "},
	{"header":"Зачем мигрировать с go build на Bazel?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/413/fcb/382/413fcb382fdeb52f4bb52a73bf33e652.jpeg","title":"Это первый пост из цикла, посвященного миграции с go build на Bazel."},
	{"header":"Микросервисные приложения на GoMicro","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/a89/f6b/168/a89f6b1686c32fe169726738801dbf88.png","title":"Go благодаря возможностям компиляции и встроенным механизмам конкурентной многозадачности очень хорошо подходит для создания сетевых приложений и активно используется в создании инструментов для DevOps и распределенных приложений. В этой статье мы рассмотрим некоторые возможности фреймворка GoMicro для реализации микросервисных приложений на Go."},
	{"header":"Rust быстрее всех, Miiao сделал замеры","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/f9d/757/228/f9d757228e7ba9add5886215037145ed.png","title":"Пассивно-агрессивный бенчмарк FizzBuzz."},
	{"header":"Schema Registry с Protobuf в Kafka — зачем оно надо?","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e5d/e7a/359/e5de7a35904f51ec08daeb9aa0e857b4.png","title":"Всем привет. Меня зовут Нина Пакшина, я разработчик “Лента Онлайн” и часть операционной команды в сервисе доставки продуктов."},
	{"header":"Hashmap(map) по версии Golang. Часть 2","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/650/189/65e/65018965ee0c5a61fdfbffa4c268c611.png","title":"Всем привет. Продолжаем реализовывать hashmap из исходников Go 1.19. Во второй части рассмотрим generic ключи и рост мапы. Узнаем что такое нерефлексивные ключи, как происходит итерация во время роста и немного про коробочное хеширование."},
	{"header":"Оптимизация доступа к элементам слайса в Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/bb3/238/b48/bb3238b489d5220af4632be32696ce6c.png","title":"Привет Хабр!"},
	{"header":"Шаблон backend сервера на Golang — часть 3 (Docker, Docker Compose, Kubernetes (kustomize)","src":"https://habrastorage.org/getpro/habr/post_images/110/b29/b5b/110b29b5bc2d9df9e250549adb05268d.jpg","title":""},
	{"header":"Обезопасить, удержать, сохранить. Выгрузка трафика анонимной сети как свойство отложенной маршрутизации в HLT","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/6d1/409/7ef/6d14097efc20e4b0a431bee6df0857d9.png","title":"Сохранение анонимного трафика HLS для последующего реиспользования."},
	{"header":"Стеклянная луковица dns внутри k8s","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/176/a89/e01/176a89e01d09cfde744f75c3530f0569.png","title":"Бесспорно, тема резолвинга dns запросов внутри k8s неоднократно поднималась на хабре и вставала ребром перед многими инженерами поддерживающими k8s кластера.  Снимая слой за слоем, попытаемся разобраться как резолвятся dns записи внутри k8s. Бонусом бегло взглянем на устройство механизма резолвинга dns для Go."},
	{"header":"За что мы любим Go, Ruby, React Native, ReactJS и Redux","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/747/65b/62f/74765b62fe138d8b4372e85dd0971327.png","title":"Привет! Это tech-команда СберМаркет. Сегодня кто-то празднует день влюбленных, а для нас с вами это ещё и профессиональный праздник — день компьютерщика. Если совместить два повода, получим день влюблённых в компьютеры. Кто-то любит копаться в железе, кто-то в программах. Кто-то пишет библиотеки, а кто-то их использует. Но все мы не равнодушны, иначе нас бы здесь не было. Эта статья — любовное письмо языкам, фреймворкам и библиотекам, которые крутятся у нас под капотом — Go, Ruby, React, React Native, Redux. "},
	{"header":"История победы в VK Cup'22/23:Go","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/0a7/b57/c68/0a7b57c68aabdaf565ba4a7c5f77d3f9.png","title":"Всем привет! 5 февраля завершился очередной VK Cup, в котором в этот раз впервые была секция посвящённая Go. О конкурсе я узнал случайно в одном из Телеграм каналов и решил посмотреть, что же там за задачи. Соревнование состояло из из 3 этапов:"},
	{"header":"Разбираемся с рекурсией на примере связных списков","src":"https://habrastorage.org/webt/1i/ew/vj/1iewvjcwy_yr33c5szwhjytxtlc.jpeg","title":""},
]
[
	{"header":"Выпускайте Кракена: опыт использования KrakenD","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/795/408/682/795408682af95f80625ba5cc86687af5.png","title":"Привет, Хабр! Меня зовут Владимир Калугин, я руковожу бэкенд-разработкой в МТС Travel. Сегодня расскажу про KrakenD, готовое решение, которое мы используем для реализации API-шлюза, важной штуки для продуктов с микросервисной архитектурой. Уверен, наш опыт может пригодиться разработчикам из других сервисов."},
	{"header":"Golang-дайджест № 25 (1 – 31 января  2023)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/674/081/8df/6740818df3aba488eb8eb16d25c0ecf2.png","title":"Свежая подборка новостей и материалов."},
	{"header":"Генератор случайных чисел на базе неопределённого поведения состояния гонки","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/dd3/1bf/bc4/dd31bfbc44d9ff24f732aad82fc73d32.png","title":"Генерация случайных чисел окружает нас везде. Любой шаг, дыхание, дуновение ветра, шум кулера, частота мяуканья кошки и т.п. уже может рассматриваться как некая генерация случайности. Так например, насколько вы контролируете вашу ходьбу? Можете ли вы с точностью до нанометра определить точку опоры? Если не можете, то сама погрешность в неопределённости расстояния начинает становиться для вас генератором случайности."},
	{"header":"Генерация Swagger для сервера Echo","src":"https://assets.habr.com/habr-web/img/avatars/180.png","title":"В процессе работы над проектом потребовалось генерировать аннотации OpenAPI налету из реализованных в проекте http-хэндлеров. Ни одна из имеющихся реализаций не удовлетворяла требованиям по удобству использования и поддержки. Поэтому пришлось написать свою обертку над echo.Group, с помощью которой можем получить swagger аннотацию на основании тех путей и с теми параметрами вызова, которые реально зарегистрированы в сервере. О причинах и путях реализации в статье."},
	{"header":"Выявляем волков в овечьей шкуре среди пользователей сайта","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/7c7/eb8/50c/7c7eb850c67b0a64d15009b500dd5380.jpg","title":"Привет, Хабр. Я в свободное время развиваю свой небольшой сайт — платформу для ведения личных дневников. Похож на ЖЖ или Дайри, но более современный и молодежный, полузакрытый, уютный. И у нас есть необходимость отслеживать, когда пользователи создают себе дополнительные аккаунты. В этом посте хочу поделиться своими идеями и опытом, как это у нас реализовано."},
	{"header":"«Извините, но вам придется закодировать Щелкунчика»","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/435/93e/feb/43593efeb174fda5807872e4cbbbe077.png","title":"Так и не попав на всем известный балет в декабре, мы решили организовать своего  Щелкунчика. Речь не о балете, а о первом в мире IT‑контесте по переводу сказки на Python, Go, C#, JavaScript и Java, задача которого звучала так: «Извините, но вам придется закодировать Щелкунчика»."},
	{"header":"Bittorrent с нуля на Go","src":"https://habrastorage.org/webt/xl/7n/3w/xl7n3wahp2d7zvypbxiikij_xxg.png","title":""},
	{"header":"Kotlin/Golang работа в двух языках","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/881/3ad/ed5/8813aded5fc0b0b13268a8b9e99dea36.png","title":"Так уж получилось, что у нас в компании используются разные стеки и языки. И в частности у нас есть большое подразделение, основным стеком которого является JVM с Kotlin в качестве языка разработки (вместо ванильной Java, на бэкенде). Но при этом этому же отделу регулярно приходится использовать в работе GoLang. "},
	{"header":"Бесит, что err != nil: главные инсайты из опроса Go-разработчиков","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/774/e63/3f3/774e633f3567f3030285ef11b9d60d31.jpg","title":"Месяц назад мы вместе с Хабром спросили у Go‑разработчиков, чем они живут, над какими задачами работают и где черпают полезную информацию о Go. В этом посте расскажем об основных инсайтах, а также узнаем, почему многие Go‑разработчики знают Python и мечтают выучить Rust."},
	{"header":"Автоматизация go get — больше не нужно запоминать названия библиотек","src":"https://assets.habr.com/habr-web/img/avatars/109.png","title":"Каждый раз, когда вы начинаете новый репозиторий программы на Go, первое, что необходимо сделать - добавить библиотеки, которые вы будете использовать. Для этого используется go get. Обычно нужные библиотеки копируются из go.mod соседнего проекта. Но копипаст - не наш метод! Под катом - небольшая утилита от автора, позволяющая назначать библиотекам и даже наборам библиотек псевдонимы."},
	{"header":"TLS 1.3, только игрушечный","src":"//habrastorage.org/r/w48/getpro/habr/avatars/96e/81d/bc0/96e81dbc01247c6c855b1806b355efa3.jpg","title":"Привет! Недавно я думала о том, насколько интересно изучать компьютерные сети, создавая рабочие версии реальных сетевых протоколов."},
	{"header":"Бардак в main, стандартизация и uber.fx. Как сделать структуру кода понятнее для всех","src":"https://habrastorage.org/webt/kd/kb/sb/kdkbsb9yavdfr-ldldqjzexuf-u.png","title":""},
	{"header":"Как построить WaitGroup на основе 32-разрядного целого числа","src":"https://habrastorage.org/webt/rl/g4/_k/rlg4_kbc54vgtxkt0v7vz1gjxj4.png","title":""},
	{"header":"Умный дом на минималках","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b95/71c/5e3/b9571c5e351a27bd9e54d8b90c8b9339.png","title":"В последнее время я всё чаще задумывался на тему реализации простых сценариев умного дома. Хотелось сделать просто, без голосового управления, минимальными вложениями для начала. Мои мечты почти разбились о суровую реальность протоколов взаимодействия умных устройств. И, о чудо, я сумел сформулировать запрос для себя правильно, Google помог мне найти «умную розетку с открытым HTTP API»."},
	{"header":"Generico! Дженерики в go или стоит ли оно того","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/37f/e41/487/37fe414873fdcb3c0caf3bd4c176802f.png","title":"15 марта 2022 года. Был морозный весенний день. Ветер старался доказать, что он не промах и залезть под куртки, кофты и прочие принадлежности гардероба, чтобы из первых рук, куда уж придётся, принести весеннее настроение через свежесть. Не очень-то у него это получалось. Причем при любом раскладе. Если попадалась хорошая куртка и не пускала незваного гостя - ветру рассказать о весне не получалось. Если же удавалось забраться за шиворот или пройтись ледяным дыханием свежести по пузу - этого уже не понимал прохожий. Кутался еще сильнее и поскорее старался уйти от этого весеннего настроения. Но это была не единственная неоднозначность. Именно 15-го марта в мир была превнесена еще одна неоднозначность, спровоцировавшая жаркие споры - релиз golang 1.18 вместе с системой generic-ов."},
	{"header":"Amazon IVS: как быстро добавить видеотрансляции в приложение или на сайт","src":"https://assets.habr.com/habr-web/img/avatars/080.png","title":"Video live streaming - это технология потоковой трансляции видео тысячам и миллионам зрителей в режиме близком к реальному времени. Видеостриминг находит своё применение в разных областях: образование, фитнес, онлайн события, электронная коммерция, игры и киберспорт."},
	{"header":"Что такое фаззинг и зачем он нужен?","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/3b3/795/c81/3b3795c818ca559f886f1da5796b8060.jpg","title":"Всем привет! Меня зовут Кирилл, я старший разработчик в группе «Полигоны и ограничения доставки» в Ozon. Cегодня я расскажу про фаззинг, встроенный в Go: что это такое, зачем он нужен в разработке программного обеспечения и как с его помощью найти баг в дикой природе open-source-коде (рассмотрим на примере)."},
	{"header":"Fuzzing-тесты в Go после v1.18: знакомство и практика","src":"https://habrastorage.org/webt/hk/a7/lw/hka7lwgirhnbdnfx4yaskcvm1hs.png","title":""},
	{"header":"Админка для Private Docker Registry (Registry Admin)","src":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/82b/df5/ad9/82bdf5ad906dc2602322d08d6b9644f2.png","title":"Концепция контейнеризации на базе Docker, и ему подобных технологий, для многих разработчиков стала незаменимым инструментом доставки своих продуктов в виде образов. В большинстве случаев для распространения используются бесплатные реестры такие как Docker Hub или GitHub Container  Registry.  Но иногда требуется развернуть свой собственный registry и управлять доступом к нему. Вариантов для развертывания своего собственного container registry предостаточно, но я решил сделать свой вариант админки для управления Private Docker Registry."},
	{"header":"Моя попытка сделать утилиту для очистки Linux","src":"https://habrastorage.org/r/w780/getpro/habr/upload_files/af0/d68/1fd/af0d681fd7a8a6ca790fca368f4a2542.jpg","title":"Всем привет! Я начинающий разработчик на языке Go. До этого у меня был, так сказать, небольшой опыт, но в виде хобби. Во время изучения я также осваивал Linux, сейчас уже пользуюсь им как основной ОС."},
]
[
